Revit 2027 API
FabricSheetType.GetWireItem Method
 Gets the Wire stored in the FabricSheetType at the associated index.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricWireItem GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
Public Function GetWireItem (
	wireIndex As Integer,
	direction As WireDistributionDirection
) As FabricWireItem
public:
FabricWireItem^ GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
member GetWireItem :
        wireIndex : int *
        direction : WireDistributionDirection -> FabricWireItem
Parameters
wireIndex Int32
 Item index in the Fabric Sheet
direction WireDistributionDirection
 Wire distribution direction of the inquired item
Return Value
FabricWireItem
 Fabric wire Item
Exceptions
Exception | Condition
ArgumentException |  The item index is either less than 0 or greater than or equal to number of items in this FabricSheetType.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  Fabric Sheet is not Custom
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace